const trains = [
  {
    id: "642M",
    schedule: [
      { name: "弘前", dep: "05:26", lat: 40.6030, lng: 140.4639 },

      { name: "撫牛子", arr: "05:29", dep: "05:30",  lat: 40.6283, lng: 140.4842 },

      { name: "川部", arr: "05:33", dep: "05:34", lat: 40.6474, lng: 140.5006},

      { name: "北常盤", arr: "05:37", dep: "05:37", lat: 40.6565, lng: 140.5284 },

      { name: "浪岡", arr: "05:42", dep: "05:43", lat: 40.7106, lng: 140.5902 },

      { name: "大釈迦", arr: "05:48", dep: "05:48", lat: 40.7313, lng: 140.6106 },

      { name: "鶴ヶ坂", arr: "05:54", dep: "05:54", lat: 40.7545, lng: 140.6548 },

      { name: "津軽新城", arr: "05:59", dep: "06:00", lat: 40.7854, lng: 140.6993 },

      { name: "新青森", arr: "06:02", dep: "06:03", lat: 40.8280, lng: 140.6934 },

　    { name: "青森", arr: "06:09", lat: 40.8222, lng: 140.7474  }
    ]
  }
];
